#1)데이터 프레임 생성
x1<-c(7, 1, 11,11, 7, 11, 3, 1, 2, 21, 1, 11, 10)
x2<-c(26, 29, 56, 31, 52, 55, 71, 31, 54, 47, 40, 66,68)
x3<-c(6, 15, 8, 8, 6, 9, 17, 22, 18, 4, 23, 9, 8)
x4<-c(60, 52, 20, 47, 33, 22, 6, 44, 22, 26, 34, 12, 12)
y<-c(78.5, 74.3, 104.3, 87.6, 95.9, 109.2, 102.7, 72.5, 93.1, 115.9, 83.8, 113.3, 109.4)
df<-data.frame(x1,x2,x3,x4,y)
head(df)

#2) 회귀모형(a) 생성
a<-lm(y~x1+x2+x3+x4, data =df)
summary(a)

#3) 유의확률이 가장 높은 변수를 제거하고 다시 회귀모형(b)를 생성
b<-lm(y~x1+x2+x4, data=df)
summary(b)

#4) 유의확률이 가장 높은 변수를 제거하고, 다시 회귀모형(c)을 생성
c<-lm(y~x1+x2,data =df)
summary(c)
